from telethon import events
import phoenix.client
client = phoenix.client.client
@events.register(events.NewMessage(outgoing=True, pattern=".الاوامر"))
async def help(event):
        await event.delete()
        messagelocation = event.to_id
        await event.client.send_message(messagelocation, ("""


<== **اوامر خدمية** ==>
 [1]الامر `.كتم` يقوم بكتم العضو مع تحديد الوقت ساعة يوم شهر  - (m, h, d)

[2] الامر `.انطق`يقوم بتحويل النص إلى صوت (امر+رمز اللغة) بالرد على النص

 [3]الامر `.طرد` يسخدم للطرد داخل المجموعة

 [4]الامر `تشغيل الرد ` يقوم بتشغل الرد التلقائي للخاص 

[5] الامر `.تاك` يقوم بعمل تاك لكل اعضاء المجموعة 

 [6] الامر `.تشفير` يقوم بتشفير وفك التشفير للنصوص (الامر بالرد) 

 [7]الامر   `.اسم`  يقوم بتغيير اسمك (الأمر +اي اسم)

[8] الامر `.تكرار` يقوم بالنشر التلقائي( الامر -الثواني -العدد-الرسالة )

[9]الامر ` .منو` يستخدم لعرض معلومات المستخدم(بالرد على الشخص)

[10](الامر `.واو` بيستخدم لحفظ الصور والفيديوهات المؤقته (بالرد على الصورة

[++] لعرض اوامر التسلية  اكتب `.تسلية`

 




Developer: @I0I0II
"""))
